stratifiedFlow/variable/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.001;

H1 30;
H2 70;

L1 600;
L2 #eval{12600 - $L1};

dz 20;

vertices
(
    // block 0 (нижний левый, вода)
    (-$L1   -$H1    0   ) // 0
    (0      -$H1    0   ) // 1
    (0      0       0   ) // 2
    (-$L1   0       0   ) // 3
    (-$L1   -$H1    $dz ) // 4
    (0      -$H1    $dz ) // 5
    (0      0       $dz ) // 6
    (-$L1   0       $dz ) // 7

    // block 1 (верхний левый, воздух)
    (-$L1   0       0   ) // 8
    (0      $H2     0   ) // 9
    (-$L1   $H2     0   ) // 10
    (-$L1   0       $dz ) // 11
    (0      $H2     $dz ) // 12
    (-$L1   $H2     $dz ) // 13

    // block 2 (верхний правый, воздух)
    ($L2   0        0   ) // 14
    ($L2   $H2      0   ) // 15
    ($L2   0        $dz ) // 16
    ($L2   $H2      $dz ) // 17

    // block 3 (нижний правый, вода)
    ($L2   -$H1     0   ) // 18
    ($L2   -$H1     $dz ) // 19
);

ny1 5;
ny2 #eval{ceil($ny1 * $H2 / $H1)};

nx1 #eval{ceil($ny1 * $L1 / $H1)};
nx2 #eval{ceil($ny1 * $L2 / $H1)};

blocks
(
    // block 0: нижний левый (вода)
    hex (0 1 2 3 4 5 6 7)   ($nx1 $ny1 1) simpleGrading (1 1 1)

    // block 1: верхний левый (воздух)
    hex (8 2 9 10 11 6 12 13) ($nx1 $ny2 1) simpleGrading (1 1 1)
    
    // block 2: верхний правый (воздух)
    hex (2 14 15 9 6 16 17 12) ($nx2 $ny2 1) simpleGrading (1 1 1)

    // block 3: нижний правый (вода)
    hex (1 18 14 2 5 19 16 6) ($nx2 $ny1 1) simpleGrading (1 1 1)
);

boundary
(
    WaterInlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    
    AirInlet
    {
        type patch;
        faces
        (
            (8 11 13 10)
        );
    }
    
    Outlet
    {
        type patch;
        faces
        (
            (14 15 17 16)
            (18 14 16 19)
        );
    }
    
    LowerWall
    {
        type wall;
        faces
        (
            (0 4 5 1)      // нижняя грань блока 0 (y = -H1)
            (1 5 19 18)    // нижняя грань блока 3 (y = -H1)
        );
    }
    
    UpperWall
    {
        type wall;
        faces
        (
            (10 13 12 9)   // верхняя грань блока 1 (y = H2)
            (15 17 12 9)   // верхняя грань блока 2 (y = H2)
        );
    }
    
    BaffleAir
    {
        type wall;
        faces
        (
            (8 2 6 11)     
        );
    }
    BaffleWater
    {
        type wall;
        faces
        (
            (3 2 6 7)      // грань блока 0 (верхняя, y=0, левая часть)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            // Передние грани (z=0)
            (0 1 2 3)      // блок 0
            (8 2 9 10)     // блок 1
            (2 14 15 9)    // блок 2
            (1 18 14 2)    // блок 3
            
            // Задние грани (z=dz)
            (4 5 6 7)      // блок 0
            (11 6 12 13)   // блок 1
            (6 16 17 12)   // блок 2
            (5 19 16 6)    // блок 3
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //